In [1]:
import numpy as np
import pandas as pd

In [2]:
data_one = {'A': ['A0', 'A1', 'A2', 'A3'],'B': ['B0', 'B1', 'B2', 'B3']}
data_two = {'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}

In [3]:
one = pd.DataFrame(data_one)
two = pd.DataFrame(data_two)

In [4]:
one

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [5]:
two

    C   D
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [6]:
pd.concat([one,two],axis=1) #column

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [7]:
pd.concat([one,two],axis=0)

     A    B    C    D
0   A0   B0  NaN  NaN
1   A1   B1  NaN  NaN
2   A2   B2  NaN  NaN
3   A3   B3  NaN  NaN
0  NaN  NaN   C0   D0
1  NaN  NaN   C1   D1
2  NaN  NaN   C2   D2
3  NaN  NaN   C3   D3

In [8]:
two.columns = one.columns

In [9]:
two

    A   B
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [10]:
pd.concat([one,two],axis=0)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
0  C0  D0
1  C1  D1
2  C2  D2
3  C3  D3

In [11]:
my_df = pd.concat([one,two],axis=0)

In [12]:
my_df.index = range(len(my_df))

In [13]:
my_df

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3
4  C0  D0
5  C1  D1
6  C2  D2
7  C3  D3

In [14]:
#Merge
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [15]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [16]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [17]:
pd.merge(registrations,logins,how='inner',on='name')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

In [18]:
pd.merge(registrations,logins,how='left',on='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [19]:
pd.merge(registrations,logins,how='right',on='name')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

In [20]:
pd.merge(registrations,logins,how='outer',on='name')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0

In [21]:
registrations = registrations.set_index('name')

In [22]:
registrations

        reg_id
name
Andrew       1
Bobo         2
Claire       3
David        4

In [23]:
pd.merge(registrations,logins,how='inner',left_index=True,right_on='name')

   reg_id  log_id    name
1       1       2  Andrew
3       2       4    Bobo

In [24]:
registrations = registrations.reset_index()
registrations.columns = ['reg_name','reg_id']

In [25]:
registrations

  reg_name  reg_id
0   Andrew       1
1     Bobo       2
2   Claire       3
3    David       4

In [26]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [27]:
results = pd.merge(registrations,logins,how='inner',left_on='reg_name',right_on='name')
results

  reg_name  reg_id  log_id    name
0   Andrew       1       2  Andrew
1     Bobo       2       4    Bobo

In [28]:
results = results.drop('reg_name',axis=1)

In [29]:
results

   reg_id  log_id    name
0       1       2  Andrew
1       2       4    Bobo

In [30]:
#Datetime

In [31]:
import numpy as np
import pandas as pd
from datetime import datetime

In [32]:
myyear=2024
mymonth = 1
myday =1
myhour=2
mymin=30
mysec=15

In [33]:
mydate = datetime(myyear,mymonth,myday)

In [34]:
mydate

datetime.datetime(2024, 1, 1, 0, 0)

In [35]:
mydatetime=datetime(myyear,mymonth,myday,myhour,mymin,mysec)

In [36]:
mydatetime

datetime.datetime(2024, 1, 1, 2, 30, 15)

In [37]:
mydatetime.year

2024

In [38]:
myser = pd.Series(['Nov 3,2020','2024-01-01',None])

In [39]:
myser

0    Nov 3,2020
1    2024-01-01
2          None
dtype: object

In [40]:
myser[0].year

AttributeError: 'str' object has no attribute 'year'

In [ ]:
timeser = pd.to_datetime(myser)

In [ ]:
timeser[0].year

In [ ]:
sales=pd.read_csv("RetailSales_BeerWineLiquor.csv")

In [ ]:
sales

In [ ]:
sales['DATE']=pd.to_datetime(sales['DATE'])

In [ ]:
sales.info()

In [ ]:
sales['DATE'][0].year

In [ ]:
sales=pd.read_csv("RetailSales_BeerWineLiquor.csv",parse_dates=['DATE'])

In [ ]:
sales.info()

In [ ]:
sales=sales.set_index('DATE')

In [ ]:
sales.resample(rule='A').mean()